{
  "books": [
    {
      "id": 1,
      "title": "Harry Potter and the Sorcerers Stone",
      "authorname": "J. K. Rowling",
      "detailsId": 1
    },
    {
      "id": 2,
      "title": "Harry Potter and the Chamber of Secrets",
      "authorname": "J. K. Rowling",
      "detailsId": 2
    },

    {
      "id": 3,
      "title": "Harry Potter and the Prisoner Of Azkaban",
      "authorname": "J. K. Rowling",
      "detailsId": 3
    },
    {
      "id": 4,
      "title": "Harry Potter and the Goblet of Fire",
      "authorname": "J. K. Rowling",
      "detailsId": 4
    },
    {
      "id": 5,
      "title": "Harry Potter and the Order of the Phoenix",
      "authorname": "J. K. Rowling",
      "detailsId": 5
    },
    {
      "id": 6,
      "title": "Harry Potter and the Half Blood Prince",
      "authorname": "J. K. Rowling",
      "detailsId": 6
    },
    {
      "id": 7,
      "title": "Harry Potter and the Deadly Hallows",
      "authorname": "J. K. Rowling",
      "detailsId": 7
    }
  ],
  "details": [
    {
      "id": 1,
      "pages": "11",
      "summary": "Adaptation of the first of J.K. Rowling's popular children's novels about Harry Potter, a boy who learns on his eleventh birthday that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own. He is summoned from his life as an unwanted child to become a student at Hogwarts, an English boarding school for wizards. There, he meets several friends who become his closest allies and help him discover the truth about his parents' mysterious deaths.",
      "rating": "4"
    },
    {
      "id": 2,
      "pages": "22",
      "title": "The second instalment of boy wizard Harry Potter's adventures at Hogwarts School of Witchcraft and Wizardry, based on the novel by JK Rowling. A mysterious elf tells Harry to expect trouble during his second year at Hogwarts, but nothing can prepare him for trees that fight back, flying cars, spiders that talk and deadly warnings written in blood on the walls of the school.",
      "rating": "4"
    },
    {
      "id": 3,
      "pages": "33",
      "summary": "Harry Potter's (Daniel Radcliffe) third year at Hogwarts starts off badly when he learns deranged killer Sirius Black (Gary Oldman) has escaped from Azkaban prison and is bent on murdering the teenage wizard. While Hermione's (Emma Watson) cat torments Ron's (Rupert Grint) sickly rat, causing a rift among the trio, a swarm of nasty Dementors is sent to protect the school from Black. A mysterious new teacher helps Harry learn to defend himself, but what is his secret tie to Sirius Black?",
      "rating": "4"
    },
    {
      "id": 4,
      "pages": "44",
      "summary": "The fourth movie in the Harry Potter franchise sees Harry (Daniel Radcliffe) returning for his fourth year at Hogwarts School of Witchcraft and Wizardry, along with his friends, Ron (Rupert Grint) and Hermione (Emma Watson). There is an upcoming tournament between the three major schools of magic, with one participant selected from each school by the Goblet of Fire. When Harry's name is drawn, even though he is not eligible and is a fourth player, he must compete in the dangerous contest.",
      "rating": "4"
    },
    {
      "id": 5,
      "pages": "55",
      "summary": "Now in his fifth year at Hogwarts, Harry (Daniel Radcliffe) learns that many in the wizarding community do not know the truth of his encounter with Lord Voldemort. Cornelius Fudge, minister of Magic, appoints his toady, Dolores Umbridge, as Defense Against the Dark Arts teacher, for he fears that professor Dumbledore will take his job. But her teaching is deficient and her methods, cruel, so Harry prepares a group of students to defend the school against a rising tide of evil.",
      "rating": "4"
    },
    {
      "id": 6,
      "pages": "66",
      "summary": "As Death Eaters wreak havoc in both Muggle and Wizard worlds, Hogwarts is no longer a safe haven for students. Though Harry (Daniel Radcliffe) suspects there are new dangers lurking within the castle walls, Dumbledore is more intent than ever on preparing the young wizard for the final battle with Voldemort. Meanwhile, teenage hormones run rampant through Hogwarts, presenting a different sort of danger. Love may be in the air, but tragedy looms, and Hogwarts may never be the same again.",
      "rating": "4"
    },
    {
      "id": 7,
      "pages": "77",
      "summary": "Harry has finally come of age, and finally started on his final journey to defeat Voldemort for good. The Durselys are forced to go into hiding so that Voldemort’s Death Eaters will not torture them for information, and Harry sets off with Ron and Hermione on a difficult quest to find and destroy the last of Voldemort’s Horcruxes. Only once those have been destroyed, Harry knows, can Voldemort truly be killed. It’s all over between Harry and Voldemort with just one spell. Harry is left alive, the true master of the Hallows, and Voldemort is killed for good. He now understands more than he ever has about love, and life, and sacrifice, and in spite of the loss of many of his friends during the last battle, is grateful for the second chance he’s been given at life, and love.",
      "rating": "5"
    }
  ]
}
